dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
#define ESP32UPBcoreversion 307

/*
ESP32 emulation of WUPB devices, over MQTT
See ESP32UPBUS140T.h and ESP32US2240T.h for device specific information

This file  covers most of the basic command set
of note is that the high bit of the second byte in the control word ("CTL2") is set high
this is against the UPB spec, but is very useful: the bridge sketch then knows which packets came from the line and which from WUPB but were send to the line
it can then filter off packets with this bit set and not RE-publish them, resulting in an infinite loop
this obviates putting the sender into the MQTT packet or having the bridge track packets it's already sent or other complicated 'solutions'

WUPB devices send  an MDID==0x80 packet to acknowledge receipt like Gen2 UPB devices, with CTL2 set to match the request (any/all of ack packet, ack pulse, ID pulse)
the PIM emulator can then use the MDID==0x80 packet to determine how to make the WUPB device appear to UPStart, including generating ID pulses to add to the network
*/

#define HOUSEMGR_PIM_ADDR                       0xFB					

#include <WiFi.h>

#include "ESP32UPBdisplay.h"
#include "ESP32UPBsecrets.h"
#include "ESP32UPBeeprom.h"
#include "ESP32UPBerrors.h"

String firmware;
String firmwaredate;
String firmwaretime;

uint32_t lastnetworkcheck=0;
#define NETWORK_CHECK_SPACING      	5*60*1000	// check for network connection every five minutes

uint32_t networkreboot;
bool networkrebootflag=false;
#define NETWORK_REBOOT_AFTER				2*60*1000 // after network loss, reboot in two minutes. allows local function without excessive cycling

#include <PubSubClient.h>
WiFiClient espClient;
PubSubClient mqttclient(espClient); 
uint32_t lastReconnectAttempt = 0;

// stuff for web server

#include "esp_task_wdt.h"
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>

AsyncWebServer webserver(80);

void notFound(AsyncWebServerRequest *request)
{
    request->send(404, "text/plain", "Not found");
}

// stuff for updates

#include <HTTPClient.h>
#include <HTTPUpdate.h>
bool flashfirmware=false;
String firmwarefile="";
bool restartflag=false;

void update_progress(uint32_t cur, uint32_t total)
{
  Serial.printf("HTTP update process at %d of %d bytes\n", cur, total);
}

void update_error(uint16_t err) // not sure if 8 or 16 or what
{
  Serial.printf("HTTP update fatal error code %d\n", err);
}

// UPB stuff

bool refreshidflag=false;

uint8_t PIMdeviceid;
char ackpacket[17];

#define SETUP_BUTTON_HOLD     5000      // hold button a while to enter/exit setup mode
#define RESET_BUTTON_WARNING  15000     // "blue" LED will flash faster at this point, approaching the above
#define RESET_BUTTON_HOLD     20000     // hold button longer to reset EEPROM to default
#define SETUP_BLINK_SPACING   500       // mS between setup LED blinks
#define RESET_BLINK_SPACING   200       // mS between reset LED blinks
#define EEPROM_SPACING        1000      // mS between updates to EEPROM while in action
#define SETUP_MODE_TIMEOUT    300000    // mS after which setup mode is cancelled
																				// has to be long enough to allow UPStart to program

#define DEBOUNCE_DELAY        50        // mS to debounce switch

char hexchars[2];

uint8_t networkid, deviceid;
uint32_t setupmodestarted;
bool writeenable=false;
uint32_t writeenablestarted;

char netv[]="0123456789ABCDEF\x00";
char room[]="0123456789ABCDEF\x00";
char devn[]="0123456789ABCDEF\x00";

uint8_t bindata[128];

uint32_t lastUPBreceive=0;

bool addressed;
bool validcommand;
uint8_t UPBcmd=0;

uint8_t oldbutton=1, button=1; // 1 is NOT pressed
uint32_t lastbuttontime=0;
bool buttonstart=false;
bool buttonpressed=false;
uint8_t buttonstage=0;
uint16_t blueLEDspacing=0;
uint16_t whiteLEDspacing=0;
uint32_t buttondelta;
uint8_t buttonstate, oldbuttonstate;
uint32_t lastdebouncetime;

bool setupmode=false;
uint32_t lastblueblink=0;
uint32_t lastredblink=0;

// the ESP takes a performance hit when doing EEPROM writes, so the commits are spaced out some
// except when absolutely required
uint32_t lastcommit=0;

// outgoing queue to PIM
#define PIM_QUEUE_SIZE       32
char PIMqueue[PIM_QUEUE_SIZE][100];
uint32_t nextsendtime;
int qdisplayflag=-1;

bool PIMready=false;
uint32_t lastPIMready=0;

// wireless side

uint8_t thisIP;

// prototypes come right before functions but after all the variables they might use

#ifdef ESP32US2240Tversion
	void device_specific_setoutput(uint8_t dimlevel, uint8_t outputchannel); // in caller
#endif

#ifdef ESP32US140Tversion
	void device_specific_setoutput(uint8_t dimlevel); // in caller
#endif

bool device_specific_command(uint8_t UPBdata[]);
void handleEditSettings(AsyncWebServerRequest *request);
String device_specific_root(void);

// in ESP32US140T.h
void device_generic_command(uint8_t UPBdata[]);

// in ESP32UPBerrors.h
void seterror(uint16_t errorlength, uint8_t errornumber);
void clearstorederror(void);

// in ESP32UPBdisplay.h
uint8_t hexcharstobyte(char thing1, char thing2);
bool isprintable(char thing);

// in shade or whatever
void reportstatus(uint8_t who);

// here
void heartbeat(uint8_t who);
void processUPB(char UPBstring[]);
void displayUPB(char dir[], char UPBstring[]);
uint8_t UPBchecksum(char UPBcommand[]);
void initWiFi(void);
void ESP32UPBsetup(void);
void ESP32UPBloop(void);
uint8_t UPBcommandlength(char UPBcommand[]);
void refreshid();
uint16_t registerchecksum(uint8_t numreg);
void UPBsend(char txstring[]);
void sendbinstring(uint8_t binarydata[]);
void UPBasib(void);
void handleRoot(AsyncWebServerRequest *request);
void handleReboot(AsyncWebServerRequest *request);
void handleUpdate(AsyncWebServerRequest *request);
String UPBdevicename(void);
void handleSaveSettings(AsyncWebServerRequest *request);
void handleUPBcommand(AsyncWebServerRequest *request);
void handleSendThisCommand(AsyncWebServerRequest *request);
String noHTMLlink(void);
void mqttcallback(char* topic, byte* payload, uint16_t msglength);
bool reconnect();
void waitformqttconnect(uint32_t cycletime);
void handleDumpRegisters(AsyncWebServerRequest *request);
void handleEnterSetupMode(AsyncWebServerRequest *request);
void handleExitSetupMode(AsyncWebServerRequest *request);

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

