dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
uint8_t UPBchecksum(char UPBcommand[])
{
  // lower five bits of CTL1 are packet length
  int packetlength=hexcharstobyte(UPBcommand[0],UPBcommand[1]) & 0b00011111;

  uint32_t total=0;

  for (int i=0; i<(packetlength-1)*2; i+=2)
  {
    total+=hexcharstobyte(UPBcommand[i],UPBcommand[i+1]);
  }

  return (256-(total & 0xFF)) & 0xFF;
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void initWiFi(void)
{
	bluLEDval=1;
	setLEDs();
	// Configures static IP address
	localip={192,168,239,thisIP};
	if (!WiFi.config(localip, gateway, netmask))
	{
		Serial.printf("WiFi failed to configure for 192.168.239.%d\n",thisIP);
		bluLEDval=0;
		setLEDs();
		seterror(100,100);
		return;
	}

  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
	
	uint32_t wificonnecttime=millis();
	
	while (
	((millis()-wificonnecttime) < 5000) // 5sec window to start wifi
	&&
	(WiFi.status()!=WL_CONNECTED)
	)
	{
		yield();
	}

	if (WiFi.status()!=WL_CONNECTED)
  {
		Serial.printf("WiFi Failed!\n");
		bluLEDval=0;
		setLEDs();
		seterror(100,100);
		return;
  }

	
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  Serial.print("MAC address: ");
  Serial.println(WiFi.macAddress());
	bluLEDval=0;
	setLEDs();
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void ESP32UPBsetup(void)
{
	Serial.print("Firmware file: "); Serial.println(firmware);

	initWiFi();
	
  webserver.on("/", HTTP_GET, handleRoot);
  webserver.on("/reboot", HTTP_GET, handleReboot);
  webserver.on("/update", HTTP_GET, handleUpdate);
  webserver.on("/edit", HTTP_GET, handleEditSettings);
  webserver.on("/upbcommand", HTTP_GET, handleUPBcommand);
  webserver.on("/entersetupmode", HTTP_GET, handleEnterSetupMode);
  webserver.on("/exitsetupmode", HTTP_GET, handleExitSetupMode);
  webserver.on("/sendthiscommand", HTTP_GET, handleSendThisCommand);
  webserver.on("/dumpregs", HTTP_GET, handleDumpRegisters);
  webserver.on("/save", HTTP_POST, handleSaveSettings); // note it's the one POST as it has too much to deal with
  webserver.onNotFound(notFound);

  webserver.begin();

  mqttclient.setServer(mqttserver, 1883);
  mqttclient.setCallback(mqttcallback);
	
	// give the MQTT loop a bit to spin up; otherwise, the first status publish(es) fail
//	waitformqttconnect(3000);

	
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void ESP32UPBloop(void)
{
	if (networkrebootflag)
	{
		if ((millis()-networkreboot) > 0)
		{
			#ifdef DISABLE_2240T_OUTPUT_FOR_UPDATE
				Serial.println("Turning off for reboot");
				device_specific_setoutput(0, 0);
			#endif
			#ifdef DISABLE_140T_OUTPUT_FOR_UPDATE
				Serial.println("Turning off for reboot");
				device_specific_setoutput(0);
			#endif
			
			networkrebootflag=false;
			Serial.println("Network failure reboot");
			ESP.restart();
		}
	}
		
  if (((millis() - lastnetworkcheck) > NETWORK_CHECK_SPACING) && (deviceid != 0xFE))
  {
    lastnetworkcheck=millis();
		#if DEBUG_LEVEL > 1
			Serial.println("Network check");
		#endif

		if (WiFi.isConnected())
		{
			if (EEPROM.read(0x1CE)==101)
			{
				Serial.println("Clearing WiFi disconnection error");
				clearstorederror();
				networkrebootflag=false;
			}

			waitformqttconnect(0);
			if (mqttclient.connected())
			{
				if (EEPROM.read(0x1CE)==103)
				{
					Serial.println("MQTT connection good, clearing disconnection error");
					clearstorederror();
					networkrebootflag=false;
				}
			}
			else
			{
				if (setupmode==false)
				{
					if (EEPROM.read(0x1CE)!=103)
					{
						Serial.println("MQTT disconnected");
						seterror(150,103);
						networkreboot=millis()+NETWORK_REBOOT_AFTER;
						networkrebootflag=true;
					}
				}
			}
			
		}
		else
		{
			if (EEPROM.read(0x1CE)!=101)
			{
				Serial.println("WiFi disconnected");
				seterror(150,101);
				networkreboot=millis()+NETWORK_REBOOT_AFTER;
				networkrebootflag=true;
			}
		}
  }

	
	// only write EEPROM changes occasionally
	if ((commitflag) && ((millis() - lastcommit) > EEPROM_SPACING))
	{
		seteepromchecksum();
		EEPROM.commit();
		lastcommit=millis();
		commitflag=false;
	}

	#ifdef BUTTON_PIN
		// debounce pushbutton

		buttonstate=digitalRead(BUTTON_PIN);

		// reset counter until reading stays stable for DEBOUNCE_DELAY mS
		if (buttonstate != oldbuttonstate) {lastdebouncetime=millis();}

		if ((millis() - lastdebouncetime) > DEBOUNCE_DELAY)
		{
			button=buttonstate;
			#if DEBUG_LEVEL > 1
				if (button != oldbutton)
				{
					Serial.printf("Button %d\n",button);
				}
			#endif
		}

		oldbuttonstate=buttonstate;

		// as it's a grounding switch on a pullup resistor
		// 0 is on and 1 is off

		if ((button==0) && (oldbutton==1))
		{
			if (buttonpressed==false)
			{
				#if DEBUG_LEVEL > 1
					Serial.println("Initial button press");
				#endif
				buttonpressed=true;
				lastbuttontime=millis();
			}
		}

		buttondelta=millis()-lastbuttontime;

		if ((button==1) && (oldbutton==0))
		{
			#if DEBUG_LEVEL > 1
				Serial.println("Button release = button stage 0");
			#endif

			if (buttonstage==1)
			{
				#if DEBUG_LEVEL > 1
					Serial.println("Short button press, toggle setup mode");
				#endif
				setupmode=!setupmode;

				if (setupmode)
				{
					Serial.println("Entering setup mode");
					blueLEDspacing=500;
					writeenable=true;
					writeenablestarted=millis();
					networkid=0x00; // broadcast network ID  
					deviceid=0xFE; // broadcast device ID
					setupmodestarted=millis();
				}
				else
				{
					Serial.println("Exiting setup mode");
					blueLEDspacing=0;
					writeenable=false;
					bluLEDval=0;
					setLEDs();
					networkid=EEPROM.read(0); // actual network ID  
					deviceid=EEPROM.read(1); // actual device ID
				}
			}

			if (buttonstage==2)
			{
				#if DEBUG_LEVEL > 1
					Serial.println("Medium button press, no action taken");
				#endif
				blueLEDspacing=0;
				whiteLEDspacing=0;
				bluLEDval=0;
				whtLEDval=0;
				setLEDs();
			}

