dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
			buttonpressed=false;
			buttonstage=0;
		}

		if (buttonpressed)
		{
			if ((buttondelta > RESET_BUTTON_WARNING) && (buttonstage == 1))
			{
				buttonstage=2;
				#if DEBUG_LEVEL > 1
					Serial.println("Medium press = button stage 2");
				#endif
				whiteLEDspacing=RESET_BLINK_SPACING;
				blueLEDspacing=RESET_BLINK_SPACING;
				bluLEDval=0;
				whtLEDval=255;
				setLEDs();
			}

			if ((buttondelta > RESET_BUTTON_HOLD) && (buttonstage == 2))
			{
				#if DEBUG_LEVEL > 1
					Serial.println("Long button press, reset to default");
				#endif
				whiteLEDspacing=0;
				blueLEDspacing=0;
				// set to off
				bluLEDval=0;
				whtLEDval=0;
				setLEDs();
				reseteeprom(EEPROM.read(0x09)+0x100*EEPROM.read(0x08)+0x10000*EEPROM.read(0x07)+0x1000000*EEPROM.read(0x06));
				dumpeeprom();
				refreshid(); // is this a good idea? should it reboot instead?
				// this prevents repeating
				buttonstage=4;
			}

			if ((buttondelta > SETUP_BUTTON_HOLD) && (buttonstage == 0))
			{
				buttonstage=1;
				#if DEBUG_LEVEL > 1
					Serial.println("Short press = button stage 1");
				#endif
				if (blueLEDspacing==SETUP_BLINK_SPACING)
				{
					blueLEDspacing=0;
					// visual cue for setup mode off
					bluLEDval=0;
					setLEDs();
				}
				else {blueLEDspacing=SETUP_BLINK_SPACING;}
			}
		}

		oldbutton=button;

	#endif

  if ((setupmode) && ((millis()-setupmodestarted) > SETUP_MODE_TIMEOUT))
  {
    Serial.println("Setup mode timeout");
    setupmode=false;
    blueLEDspacing=0;
    networkid=EEPROM.read(0); // actual network ID  
    deviceid=EEPROM.read(1); // actual device ID
		bluLEDval=0;
		setLEDs();
  }
  
  if (blueLEDspacing)
  {
    if ((millis()-lastblueblink) > blueLEDspacing)
    {
			bluLEDval=255*(!bluLEDval);
			setLEDs();
      lastblueblink=millis();
    }
  }
 
  if (whiteLEDspacing)
  {
    if ((millis()-lastredblink) > whiteLEDspacing)
    {
			whtLEDval=255*(!whtLEDval);
			setLEDs();
      lastredblink=millis();
    }
  }

  if (error)
  {
    if ((millis()-lastredblink) > error)
    {
			redLEDval=255*(!redLEDval);
			setLEDs();
      lastredblink=millis();
    }
  }

  if ((writeenable) && ((millis()-writeenablestarted) > SETUP_MODE_TIMEOUT))
  {
    Serial.println("Write enable timeout");
		Serial.println("****** Write enable false");
    writeenable=false;
  }


	if (!mqttclient.connected())
  {
    uint32_t now = millis();
    if (now - lastReconnectAttempt > 5000)
    {
      lastReconnectAttempt = now;
      // Attempt to reconnect
      if (reconnect())
      {
        lastReconnectAttempt = 0;
      }
    }
  }
  else
  {
    // Client connected
    mqttclient.loop();
  }

	// if so directed by handleReboot, restart
	// this is outside of handleReboot so that the browser renders the "please wait" page patiently
	// with this code in handleReboot, the browser gets stuck waiting for the server to send completely

	if (restartflag)
	{
		#ifdef DISABLE_140T_OUTPUT_FOR_UPDATE
			Serial.println("Turning off for reboot");
			device_specific_setoutput(0);
		#endif
		#ifdef DISABLE_2240T_OUTPUT_FOR_UPDATE
			Serial.println("Turning off for update");
			device_specific_setoutput(0, 0);
    #endif
		ESP.restart();
	}

	// if so directed by handleUpdate, flash the firmware to a new image
	// this is outside of handleUpdate so that the browser renders the "please wait" page patiently
	// with this code in handleUpdate, the browser gets stuck waiting for the server to send completely

  if (flashfirmware)
  {
		Serial.println("Doing the upload");

		// for e.g. devices with triac, turn off output, so as to avoid strobing during update
		#ifdef DISABLE_2240T_OUTPUT_FOR_UPDATE
			Serial.println("Turning off for update");
			device_specific_setoutput(0, 0);
    #endif
		#ifdef DISABLE_140T_OUTPUT_FOR_UPDATE
			Serial.println("Turning off for update");
			device_specific_setoutput(0);
    #endif

    WiFiClient client;

		// bump up watchdog timer so as not to reboot in the middle of updating
		esp_task_wdt_config_t wdtconfig = {
			.timeout_ms = 2 * 60 * 1000, // two minutes
      .idle_core_mask = 0,    // Bitmask of cores
      .trigger_panic = true,			
		};

		esp_task_wdt_reconfigure(&wdtconfig);
	
    httpUpdate.onProgress(update_progress);
	
    httpUpdate.onError(update_error);

    #ifdef WHITE_LED_PIN
      httpUpdate.setLedPin(WHITE_LED_PIN, LOW);
    #endif
  
    t_httpUpdate_return ret = httpUpdate.update(client, firmwarefile);
  
    switch (ret)
    {
      case HTTP_UPDATE_FAILED: Serial.printf("HTTP_UPDATE_FAILED Error (%d): %s\n", httpUpdate.getLastError(), httpUpdate.getLastErrorString().c_str()); break;
  
      case HTTP_UPDATE_NO_UPDATES: Serial.println("HTTP_UPDATE_NO_UPDATES"); break;
  
      case HTTP_UPDATE_OK: Serial.println("HTTP_UPDATE_OK"); break;
    }
  }
	
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

uint8_t UPBcommandlength(char UPBcommand[])
{
  return (hexcharstobyte(UPBcommand[0],UPBcommand[1]) & 0b00011111);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void UPBasib(void)
{
	#ifdef ESP_ARDUINO_VERSION_MAJOR 
		Serial.printf("ESP-Arduino              v%d.%d.%d\n",ESP_ARDUINO_VERSION_MAJOR,ESP_ARDUINO_VERSION_MINOR,ESP_ARDUINO_VERSION_PATCH);
	#endif

  #ifdef ESP32US140Tversion
    Serial.printf("ESP32US140T version      %d\n",ESP32US140Tversion);
  #endif

  #ifdef ESP32US2240Tversion
    Serial.printf("ESP32US2240T version     %d\n",ESP32US2240Tversion);
  #endif

  #ifdef ESP32UPBcoreversion
    Serial.printf("ESP32UPBcore version     %d\n",ESP32UPBcoreversion);
  #endif

  #ifdef ESP32UPBeepromversion
    Serial.printf("ESP32UPBeeprom version   %d\n",ESP32UPBeepromversion);
  #endif

  #ifdef ESP32UPBdisplayversion
    Serial.printf("ESP32UPBdisplay version  %d\n",ESP32UPBdisplayversion);
  #endif

