dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
  #ifdef ESP32UPBerrorsversion
    Serial.printf("ESP32UPBerrors version   %d\n",ESP32UPBerrorsversion);
  #endif
		
  Serial.println();
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void refreshid()
{
	localip={192,168,239,deviceid};
	if (!WiFi.config(localip, gateway, netmask))
	{
		Serial.printf("WiFi failed to configure for 192.168.239.%d\n",deviceid);
		bluLEDval=0;
		setLEDs();
		seterror(100,100);
		return;
	}
	
  char tempstring[100];
  
  for (uint8_t i=0; i<16; i++)
  {
    netv[i]=EEPROM.read(16+i);
    room[i]=EEPROM.read(32+i);
    devn[i]=EEPROM.read(48+i);
  }

  #if DEBUG_LEVEL > 1
    // answering to...
		if (deviceid != EEPROM.read(1))
		{
			Serial.println("----------------------------------------------------");
			Serial.println("Change ID");
			Serial.println("----------------------------------------------------");
		}
    Serial.printf("Network ID:  %02X\n",networkid);
    Serial.printf("UPB ID:      %02X (%d)\n",deviceid,deviceid);
    Serial.printf("Serial:      %u\n",16777216*EEPROM.read(12)+65536*EEPROM.read(13)+256*EEPROM.read(14)+EEPROM.read(15));
    Serial.printf("Password:    %02X%02X\n",EEPROM.read(2),EEPROM.read(3));
    Serial.printf("Network:     %s\n",netv);
    Serial.printf("Room:        %s\n",room);
    Serial.printf("Device name: %s\n",devn);
  #endif
	
	// give the MQTT loop a bit to spin up; otherwise, publish(es) fail
	waitformqttconnect(5000);
	
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-


uint16_t registerchecksum(uint8_t numreg)
{
  // cheating as uint16_t won't ever go over FFFF. we hope.

  uint16_t total=0;
  
  for (uint8_t i=0; i<numreg; i++)
  {
    total=total+EEPROM.read(i);
  }
 
  return total;
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void displayUPB(char dir[], char UPBstring[])
{
  char tempstring[100];
    
  // lower five bits of CTL1 are packet length
  uint8_t packetlength=UPBcommandlength(UPBstring);

  Serial.print("   CT1 CT2 NID DST SRC MSG ");
  for (uint8_t i=6; i<packetlength-1; i++)
  {
    Serial.printf("MD%02d ",i-6);
  }

  Serial.println("CS");

  Serial.print(dir);

  for (uint8_t i=0; i<packetlength; i++)
  {
    if (isprintable(UPBstring[2*i])) {Serial.print(UPBstring[2*i]);} else {Serial.printf("[%02X]",UPBstring[2*i]);}		
    if (isprintable(UPBstring[2*i+1])) {Serial.print(UPBstring[2*i+1]);} else {Serial.printf("[%02X]",UPBstring[2*i+1]);}
    
    Serial.print("  ");
    if (i>5) {Serial.print(" ");}
  }

  Serial.println();
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

// binary data --> chars to send

void sendbinstring(uint8_t binarydata[])
{
	// lower five bits of CTL1 are packet length
	uint8_t packetlength=binarydata[0] & 0b00011111;

	char tempstring[100];
	
	for (uint8_t i=0; i<(packetlength-1); i++)
	{
		int8_t a=binarydata[i] >> 4; if (a>9) {a+=7;} a+=48;
		int8_t b=binarydata[i] & 0xF; if (b>9) {b+=7;} b+=48;
		tempstring[i*2]=a;
		tempstring[i*2+1]=b;
	}
	tempstring[2*(packetlength-1)]=0x00;

	UPBsend(tempstring);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

// send *ASCII* command string to UPB (WUPB packet)
// calculates checksum (performed on *binary* versions of the values, ugh)

void UPBsend(char txstring[])
{
	// make a copy
  // manipulating the one passed in is bad string juju
	// this is not always called with space for checksum included
	// typical poor programming on the part of the author
	// as a workaround, create a string of the correct size
	// then set transmit sequence *and* checksum for each send

  uint8_t packetlength=UPBcommandlength(txstring);

	char localstring[100];
	memcpy(localstring,txstring,2*packetlength+1);

	uint8_t ct1=hexcharstobyte(localstring[0],localstring[1]);
	
	uint8_t ct2=hexcharstobyte(localstring[2],localstring[3]);

	// set high bit of CT2 to indicate WUPB
	// against spec, see UPB Description v1.4 actual page 18
	// see above as to why this is done
	ct2=ct2 | 0b10000000;


	// unless ID pulse specified, force to ack pulse. this placates UPStart, but makes all devices appear as Gen1 (less 0x80 packets)
	// may or may not matter
	
	if ((ct2 & 0b00100000) != 0b00100000)
	{
		ct2=(ct2 & 0b10001111) | 0b00010000;
	}

	localstring[2]=bytetohexchar(ct2,HIGH);
	localstring[3]=bytetohexchar(ct2,LOW);
	
	// recalculate checksum
	uint8_t checksum=UPBchecksum(localstring);

	// write checksum into string
	localstring[packetlength*2-2]=bytetohexchar(checksum,HIGH);
	localstring[packetlength*2-1]=bytetohexchar(checksum,LOW);
	
	#if DEBUG_LEVEL > 1
		Serial.printf("Sending %d characters: ",2*packetlength);
		printableprint(localstring,2*(packetlength),true);
	#endif
	
	// display data
	#if DEBUG_LEVEL > 1
		char dispstring[100];
		strcpy(dispstring,localstring);
		dispstring[packetlength*2]=0x00;
		displayUPB("Tx ",dispstring);
	#endif
 
	char sendstring[100];

	memcpy(sendstring,localstring,(packetlength-1)*2);

	sendstring[(packetlength-1)*2]=bytetohexchar(checksum,HIGH);
	sendstring[(packetlength-1)*2+1]=bytetohexchar(checksum,LOW);
	sendstring[(packetlength-1)*2+2]=0x00;
		
	
	if (mqttclient.publish(wupbtopic, sendstring)==false)
	{
		Serial.println("MQTT publish failure");
		seterror(150,104);
	}
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void setLEDs()
{
	#if DEBUG_LEVEL > 2
		Serial.printf("Setting individual LEDs to R%d G%d B%d W%d\n",redLEDval,grnLEDval,bluLEDval,whtLEDval);
	#endif

	#ifdef RED_LED_PIN
		digitalWrite(RED_LED_PIN, redLEDval);
	#endif
	
	#ifdef WHITE_LED_PIN
		digitalWrite(WHITE_LED_PIN, whtLEDval);
	#endif
	
	#ifdef BLUE_LED_PIN
		digitalWrite(BLUE_LED_PIN, bluLEDval);
	#endif
	
	#ifdef GREEN_LED_PIN
		ledcWrite(GREEN_LED_PIN, grnLEDval);
//			Serial.printf("Writing %d to ledc channel %d\n",grnLEDval,GREEN_LED_CHANNEL);
	#endif

	#ifdef SECOND_LED_PIN
		ledcWrite(SECOND_LED_PIN, secLEDval);
//			Serial.printf("Writing %d to ledc channel %d\n",secLEDval,SECOND_LED_CHANNEL);
	#endif
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void handleRoot(AsyncWebServerRequest *request)
{
//  Serial.print("Root GET from ");
//  Serial.println(request->client()->remoteIP());

	String devicevid;
	String devicepid;
	
	devicevid=String(bytetohexchar(EEPROM.read(6),HIGH))+
	String(bytetohexchar(EEPROM.read(6),LOW))+
	String(bytetohexchar(EEPROM.read(7),HIGH))+
	String(bytetohexchar(EEPROM.read(7),LOW));
	
	devicepid=String(bytetohexchar(EEPROM.read(8),HIGH))+
	String(bytetohexchar(EEPROM.read(8),LOW))+
	String(bytetohexchar(EEPROM.read(9),HIGH))+
	String(bytetohexchar(EEPROM.read(9),LOW));
  
  String reply;

	// no trailing + when line is just string lit
	
