dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
  reply="<HTML><head><title>"+UPBdevicename()+
	"</title></head><body bgcolor=\"#ffffff\" text=\"#000000\" link=\"#0000ff\" alink=\"#0000ff\" vlink=\"#0000ff\">\n"
	+noHTMLlink()+	
	"<h2>"+UPBdevicename()+"</h2><p>\n"+
	"<table>\n"
	"<tr><td>Firmware</td><td>"+String(firmware)+"</td></tr>\n"+
  "<tr><td>written</td><td>"+String(firmwaredate)+" "+String(firmwaretime)+"</td></tr>\n"+
  "<tr><td>Board type</td><td>"+String(ARDUINO_BOARD)+"</td></tr>\n"+
  "<tr><td>Device VID</td><td>"+devicevid+"</td></tr>\n"+
  "<tr><td>Device PID</td><td>"+devicepid+"</td></tr>\n"+
  "<tr><td>MAC address</td><td>"+WiFi.macAddress()+"</td></tr>\n"+
  "<tr><td>WiFi channel</td><td>"+WiFi.channel()+"</td></tr>\n"+
  "<tr><td>WiFi RSSI</td><td>"+WiFi.RSSI()+"dB &#x1F4F6;</td></tr>\n"
  #ifdef ESP_ARDUINO_VERSION_MAJOR 
    "<tr><td>ESP-Arduino</td><td>"+
    String(ESP_ARDUINO_VERSION_MAJOR)+"."+
    String(ESP_ARDUINO_VERSION_MINOR)+"."+
    String(ESP_ARDUINO_VERSION_PATCH)+
    "</td><tr>\n"+
  #endif
  #ifdef ESP32US140Tversion
    "<tr><td>ESP32US140Tversion</td><td>"+String(ESP32US140Tversion)+"</td><tr>\n"+
  #endif
  #ifdef ESP32US2240Tversion
    "<tr><td>ESP32US2240Tversion</td><td>"+String(ESP32US2240Tversion)+"</td><tr>\n"+
  #endif
  #ifdef ESP32UPBcoreversion
    "<tr><td>ESP32UPBcoreversion</td><td>"+String(ESP32UPBcoreversion)+"</td><tr>\n"+
  #endif
  #ifdef ESP32UPBeepromversion
    "<tr><td>ESP32UPBeepromversion</td><td>"+String(ESP32UPBeepromversion)+"</td><tr>\n"+
  #endif
  #ifdef ESP32UPBdisplayversion
    "<tr><td>ESP32UPBdisplayversion</td><td>"+String(ESP32UPBdisplayversion)+"</td><tr>\n"+
  #endif
  #ifdef ESP32UPBerrorsversion
    "<tr><td>ESP32UPBerrorsversion</td><td>"+String(ESP32UPBerrorsversion)+"</td><tr>\n"+
  #endif
	"</table><p>\n"+
	
	device_specific_root();

  uint8_t errornum=EEPROM.read(0x1CE);
  if (errornum)
  {
    uint16_t parm1=EEPROM.read(0x1D0)*0x100+EEPROM.read(0x1D1);
    uint16_t parm2=EEPROM.read(0x1D2)*0x100+EEPROM.read(0x1D3);
    reply=reply+"<font color=\"#800000\">Error "+String(errornum)+" Param1 "+String(parm1)+" Param2 "+String(parm2)+"</font><p>\n";
  }

	reply=reply+"Setup mode <b>";
	if (setupmode)
	{
		reply=reply+"Yes";
	}
	else
	{
		reply=reply+"No";
	}
	reply=reply+"</b><p>";

	reply=reply+
	"<a href=\"/entersetupmode?return=/\">&#x260B; Enter setup mode</a> &nbsp;\n"
	"<a href=\"/exitsetupmode?return=/\">&#x260A; Exit setup mode</a> &nbsp;\n"
  "<a href=\"/upbcommand?cmd=30&return=/\">&#x260E; Report status</a> &nbsp;\n"
  "<a href=\"/upbcommand?cmd=0C&return=/\">&#x2705; Clear error</a> &nbsp;\n"
	"<a href=\"/edit\">&#x270E; Edit settings</a> \n"
	"<a href=\"/update\">&#x1F5F2; Upload firmware</a> &nbsp; \n"
	"<a href=\"/reboot\">&#x21f5; Reboot</a> &nbsp; \n"
	"<a href=\"/\">&#x21bb; Refresh</a><br>\n"
	
  "</body></html>";

  request->send(200, "text/html", reply);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void handleUpdate(AsyncWebServerRequest *request)
{
  String filename;
  filename="";
  bool dotheupload=false;

	String boardtype=String(ARDUINO_BOARD);

	String devicetype=firmware;
	devicetype=devicetype.substring(1+devicetype.lastIndexOf("\\"));
	devicetype=devicetype.substring(0,devicetype.indexOf("_"));
	
  // odd order of <html> and <body> tags allows easy insertion of
  // <meta refresh...> only when upload actually occurs

  String reply;
  reply="<body>"+noHTMLlink();

  if (request->hasParam("filename"))
  {
      filename= request->getParam("filename")->value();
//      Serial.print("Filename ");
//      Serial.println(filename);
  }

  if (filename.equals(""))
  {
		String serverPath;
		
		HTTPClient http;
		serverPath="http://192.168.123.14/cgi-bin/wupbfilenames.pl?boardtype="+boardtype+"&devicetype="+devicetype;
		http.begin(serverPath.c_str());
						
		// Send HTTP GET request
		int httpResponseCode = http.GET();
		
		if (httpResponseCode>0)
		{
			#if DEBUG_LEVEL > 1
				Serial.print("HTTP Response code: ");
				Serial.println(httpResponseCode);
			#endif
			reply = http.getString();
		}
		else
		{
			#if DEBUG_LEVEL > 1
				Serial.print("Error code: ");
				Serial.println(httpResponseCode);
			#endif
			reply="Error "+String(httpResponseCode);
		}
		// Free resources
		http.end();
		request->send(200, "text/html", reply);
		return;
  }
  else
  {
		#if DEBUG_LEVEL > 1
			Serial.print("Directed to update to ");
			Serial.println(filename);
		#endif

    String boardtype=String(ARDUINO_BOARD);
    boardtype.toLowerCase();
    int8_t boardtypefound=filename.indexOf(boardtype);
  
    if (boardtypefound==-1)
    {
			Serial.println("Board mismatch");
			Serial.print("This board is ");
			Serial.print(boardtype);
			Serial.print(" but filename is ");
			Serial.println(filename);
      reply=reply+"Board mismatch; this board is </b>"+boardtype+"</b> but filename is <b>"+filename+"</b>";
    }
    else
    {
			Serial.print("Update filename ");
			Serial.println(filename);

      reply="<meta http-equiv=\"refresh\" content=\"40; URL=/\">"+reply+"Uploading file <b>"+filename+"</b>. This page will refresh to the device home, be patient.<p>";
      dotheupload=true;
    }
  }  
	
	reply="<html>"+reply+"</body></html>";
	request->send(200, "text/html", reply);

	if (dotheupload)
	{
		flashfirmware=true;
		firmwarefile="http://192.168.123.14/wupb/"+filename;
	}

	return;
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void handleReboot(AsyncWebServerRequest *request)
{
	String reply;
  reply="<meta http-equiv=\"refresh\" content=\"10; URL=/\">Rebooting";
  request->send(200, "text/html", reply);
	restartflag=true;
//	delay(500);
//	ESP.restart();
}

// process any valid commands or mark as invalid

void processUPB(char UPBstring[])
{
	// ignore 0x80-0xFF reports from other devices
	uint8_t msgid=hexcharstobyte(UPBstring[0x0A],UPBstring[0x0B]);

