dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
	if (msgid>=0x80)
	{
		#if DEBUG_LEVEL > 2
			Serial.printf("Ignoring MDID %02X report\n",msgid);
		#endif
		return;
	}
 
  validcommand=false;
  addressed=false;
  uint8_t packetlength=UPBcommandlength(UPBstring);
	
  #if DEBUG_LEVEL > 1
    Serial.printf("Received UPB data of %d bytes\n",packetlength);
  #endif

  // main UPB command processing

  uint8_t UPBdata[packetlength];

  for (uint8_t i=0; i<packetlength; i++)
  {
    UPBdata[i]=hexcharstobyte(UPBstring[2*i],UPBstring[2*i+1]);
  }

	// -*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	// include device-specific command values and code
	// to allow this file to remain generic and unmodified per-device
	// only updated for new features or bugfixes
	// processing *outside* the addressed check above allows this code
	// to check for commands or links sent to other devices
	// returns true to bypass regular processing 
	// -*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	
	if (device_specific_command(UPBdata)==false)
	{
		uint8_t ct1=UPBdata[0];
		uint8_t ct2=UPBdata[1];
		uint8_t nid=UPBdata[2];
		uint8_t dst=UPBdata[3];
		uint8_t src=UPBdata[4];
		uint8_t msg=UPBdata[5];

		bool linkflag=UPBdata[0]>>7;
		uint8_t linknum;
		uint8_t regstart;
		uint8_t regcount;
		
		uint8_t linklevel=100;

		addressed=false;

		// device addressing -- just compare to ID. don't use deviceid as it is 254 during setup mode
		if ((dst == EEPROM.read(1)) && (linkflag == 0))
		{
			#if DEBUG_LEVEL > 1
				Serial.printf("Addressed as device %d\n",dst);
			#endif
			addressed=true;
		}

		if ((dst == 253) && (writeenable) && (linkflag == 0))
		{
			#if DEBUG_LEVEL > 1
				Serial.println("Addressed as write-enabled device");
			#endif
			addressed=true;
		}

		if ((dst == 254) && (setupmode) && (linkflag == 0))
		{
			#if DEBUG_LEVEL > 1
				Serial.println("Addressed as setup mode device");
			#endif
			addressed=true;
		}

		// destination 0 is broadcast, all devices listen
		if ((dst == 0) && (linkflag == 0))
		{
			#if DEBUG_LEVEL > 1
				Serial.println("Addressed via broadcast");
			#endif
			addressed=true;
		}

		// link addressing -- must compare to table
		
		if (linkflag==1)
		{
			device_generic_command(UPBdata);
		}

		// show incoming just for us unless higher debug

		if (addressed)
		{
			#if DEBUG_LEVEL > 1
				displayUPB("Rx ",UPBstring);
			#endif
		}
		else
		{
			#if DEBUG_LEVEL > 2
				displayUPB("Rx ",UPBstring);
			#endif
		}

		if (addressed) // That's us
		{
			uint8_t ackreq=(ct2 & 0b01110000) >> 4;

			// ID pulses on broadcast works on the line, each device pops its own pulse and no others
			// this is for UPBv2 enumeration, see UPB Description 1.4 actual pages 22-23
			// but doesn't work with WUPB, as the bridge would have to wait for all the packets and then generate pulses
			// and the bridge has no idea how many devices there are
			if ((dst==0) && (ackreq == 0b010))
			{
				Serial.println("Broadcast ID pulse requested, changing to ack pulse");
				ackreq=0b001;
				ct2=(ct2 & 0b10001111) | 0b00010000;
			}

			// if any type of ack requested, send an 0x80 with same CT2 as incoming packet
			// bridge converts to pulses as needed
			// send first thing so as to placate UPStart
			
			if (ackreq)
			{
				sprintf(ackpacket,"08%02X02%02X%02X80%02XCS\x00",ct2,src,thisIP,msg);
				#if DEBUG_LEVEL > 1
					Serial.printf("Ack packet %s\n",ackpacket);
				#endif
				UPBsend(ackpacket);
			}
			
			uint8_t optbytes=packetlength-7;
		
			// these commands should be valid for all device types
		
			// ping, no options
			if ((msg == 0x00) && (optbytes==0))
			{
				validcommand=true;
				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Ping");
				#endif
				return;
			}

			// null command, any options
			if ((msg == 0x00) && (optbytes))
			{
				validcommand=true;
//				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Null");
				#endif
				return;
			}

			// write enable, requires password
			if ((msg == 0x01) && (optbytes==2) && (UPBdata[6]==EEPROM.read(2)) && (UPBdata[7]==EEPROM.read(3)))
			{
				validcommand=true;
				clearstorederror();
				Serial.println("Write enable true");
				writeenable=true;
				writeenablestarted=millis();

				return;
			}

			// write protect
			if (msg == 0x02)
			{
				validcommand=true;
				clearstorederror();
				Serial.println("Write enable false");
				writeenable=false;
				setupmode=false;
				bluLEDval=0;
				setLEDs();

				seteepromchecksum();
				EEPROM.commit();
				return;
			}

			// enter setup mode, requires password
			if ((msg == 0x03) && (optbytes==2) && (UPBdata[6]==EEPROM.read(2)) && (UPBdata[7]==EEPROM.read(3)))
			{
				validcommand=true;
				clearstorederror();
				Serial.println("Enter setup mode");
				setupmode=true;
				blueLEDspacing=SETUP_BLINK_SPACING;
				setupmodestarted=millis();
				networkid=0x00; // broadcast network ID
				deviceid=0xFE; // broadcast device ID 
				return;
			}

			// exit setup mode
			if (msg == 0x04)
			{
				validcommand=true;
				clearstorederror();
				Serial.println("Exit setup mode");
				bluLEDval=0;
				setLEDs();

				setupmode=false;
				blueLEDspacing=0;

				networkid=EEPROM.read(0); // actual network ID  
				deviceid=EEPROM.read(1); // actual device ID
				
				// only if the device or network ID registers were changed
				// should the device be restarted with the new address
				if (refreshidflag)
				{
					refreshidflag=false;
					Serial.println("Rebooting from ID change");
					ESP.restart();
				}
				
				return;
			}

			// get setup time
			if (msg == 0x05)
			{
				validcommand=true;
				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Get setup time");
				#endif
				
				bindata[0]=0x0A;  		  // CTL1
				bindata[1]=EEPROM.read(0x8E) & 0b00001100;  	// CTL2 includes transmission count
				bindata[2]=networkid;   // NID
				bindata[3]=src;        	// dest (requester)
				bindata[4]=deviceid;    // src (me)
				bindata[5]=0x85;        // setup time report
				bindata[6]=0x42;				// random
				bindata[7]=(millis()-setupmodestarted)/2; // should actually be /2.133, whatever
				sendbinstring(bindata);
				
				return;
			}

			// get current error
			// works the same as 0x10 CC 0C (read CC-D7) except without clearing error
			if (msg == 0x07) 
			{
				validcommand=true;
				bindata[0]=15;			  	// CTL1
				bindata[1]=EEPROM.read(0x8E) & 0b00001100;  	// CTL2 includes transmission count
				bindata[2]=networkid;   // NID
				bindata[3]=src;        	// dest (requester)
				bindata[4]=deviceid;    // src (me)
				bindata[5]=0x87;        // error report
				for (uint8_t i=0; i<0x08; i++) {bindata[6+i]=EEPROM.read(0x1CC+i);}

				#if DEBUG_LEVEL > 1
					Serial.println("Get error data");
					Serial.printf("Error code   %02X\n",bindata[0x09]);
					Serial.printf("Error length %04X\n",bindata[0x07]*0x100+bindata[0x06]);
					Serial.printf("Error parm 1 %04X\n",bindata[0x0A]*0x100+bindata[0x0B]);
					Serial.printf("Error parm 2 %04X\n",bindata[0x0C]*0x100+bindata[0x0D]);
				#endif

				sendbinstring(bindata);
				return;
			}

			// set current error
			// works the same as 0x11 CC 02 and 0x10 CE 01 (write CC-CE), except without clearing error
			if (msg == 0x08) 
			{
				validcommand=true;
				error=UPBdata[8]*0x100+UPBdata[7];
				EEPROM.write(0x1CE,UPBdata[6]);
				EEPROM.write(0x1CD,UPBdata[7]);
				EEPROM.write(0x1CC,UPBdata[8]);
				commitflag=true;

				#if DEBUG_LEVEL > 1
					Serial.printf("Set error code %d length %d\n",UPBdata[6],UPBdata[8]*0x100+UPBdata[7]);
				#endif

				if (error==0)
				{
					redLEDval=0;
					setLEDs();
				}
				return;
			}

