dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
			// clear  error
			if (msg == 0x0C) 
			{
				clearstorederror();
				
				validcommand=true;

				#if DEBUG_LEVEL > 1
					Serial.println("Clear error\n");
				#endif

				redLEDval=0;
				setLEDs();
				return;
			}


			// transmit this message
			if (msg == 0x0d)
			{
				validcommand=true;
				clearstorederror();
				
				Serial.print("Transmitting this message: ");
				
				for (uint8_t i=0; i<optbytes; i++)
				{
					bindata[i]=UPBdata[6+i];
					Serial.printf("%02X ",bindata[i]);
				}
				Serial.println();

				sendbinstring(bindata);
				return;
			}


			// reset device
			if ((msg == 0x0E) && (optbytes==2) && (UPBdata[6]==EEPROM.read(2)) && (UPBdata[7]==EEPROM.read(3)))
			{
				validcommand=true;
				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Restart");
				#endif
				delay(1000);
				ESP.restart();
				return;
			}

			// get device signature
			if (msg == 0x0f) 
			{
				validcommand=true;
				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Get signature");
				#endif

				bindata[0]=0x18;      // CTL1
				bindata[1]=EEPROM.read(0x8E) & 0b00001100;  // CTL2 includes transmission count
				bindata[2]=networkid; // NID
				bindata[3]=src;       // dest (requester)
				bindata[4]=deviceid;  // Src (me)
				bindata[5]=0x8F;      // Device signature report

				uint8_t CS1H=registerchecksum(64) >> 8;
				uint8_t CS1L=registerchecksum(64) & 0xFF;
				
				uint8_t CS2H=registerchecksum(192)>> 8;
				uint8_t CS2L=registerchecksum(192) & 0xFF;
				
				bindata[6]=0x2A;      // random number high
				bindata[7]=0xAF;      // random number low
				bindata[8]=0xFF;			// signal strength is meaningless for WUPB
				bindata[9]=0x00;			// noise floor is meaningless for WUPB
				bindata[10]=CS1H;
				bindata[11]=CS1L;
				bindata[12]=CS2H;
				bindata[13]=CS2L;

				// number of registers, varies by device
				#ifdef ESP32US140Tversion				
					bindata[14]=0xC0;
				#endif
				#ifdef ESP32US2240Tversion				
					bindata[14]=0xF6;
				#endif
				
				bindata[15]=0x00;      // diagnostic 0
				bindata[16]=0x00;      // diagnostic 1
				bindata[17]=0x00;      // diagnostic 2
				bindata[18]=0x00;      // diagnostic 3
				bindata[19]=0x00;      // diagnostic 4
				bindata[20]=0x00;      // diagnostic 5
				bindata[21]=0x00;      // diagnostic 6
				bindata[22]=0x00;      // diagnostic 7
				
				sendbinstring(bindata);
				return;
			}

			// get registers
			if (msg == 0x10) 
			{
				validcommand=true;
				
				regstart=UPBdata[6];
				regcount=UPBdata[7];

				#if DEBUG_LEVEL > 1
					Serial.printf("Get register(s) %02X-%02X = ",regstart,regstart+regcount-1);
					Serial.println(); // remove
				#endif

				bindata[0]=8+regcount;  // CTL1
				bindata[1]=EEPROM.read(0x8E) & 0b00001100;  	// CTL2 includes transmission count
				bindata[2]=networkid;   // NID
				bindata[3]=src;        	// dest (requester)
				bindata[4]=deviceid;    // src (me)
				bindata[5]=0x90;        // register report
				bindata[6]=regstart;    // number

				for (uint8_t i=0; i<regcount; i++)
				{
					bindata[7+i]=EEPROM.read(regstart+i);
					#if DEBUG_LEVEL > 1
						Serial.printf("%02X ",bindata[7+i]); 
					#endif
				}
				#if DEBUG_LEVEL > 1
					Serial.println();
				#endif

				sendbinstring(bindata);
				return;
			}

			// set registers
			if ((msg == 0x11) && !writeenable && !setupmode)
			{
				Serial.println("Shouldn't set registers unless write enable off or in setup mode");
			}

//			if ((msg == 0x11) && (writeenable || setupmode))
			if (msg == 0x11)
			{
				validcommand=true;
				clearstorederror();
				regstart=UPBdata[6];
				regcount=packetlength-8;

				if (regcount > 0x10)
				{
					Serial.println("Excessive register count to write");
					regcount=0x10;
				}
				
				#if DEBUG_LEVEL > 1
					Serial.printf("Set register(s) %02X-%02X = ",regstart,regstart+regcount-1);
				#endif

				for (uint8_t i=0; i<regcount; i++)
				{
					#if DEBUG_LEVEL > 1
						Serial.printf("%02X ",UPBdata[7+i]);
					#endif
					
					EEPROM.write(regstart+i,UPBdata[7+i]);

					// if the UPB ID is rewritten, redisplay ID info
					if ((regstart+i) == 0)
					{
						if (networkid != UPBdata[7+i])
						{
							Serial.println("Changed network ID");
							networkid=UPBdata[7+i];
							refreshidflag=true;
						}
					}
					if ((regstart+i) == 1)
					{
						if (deviceid != UPBdata[7+i])
						{
							Serial.println("Changed device ID");
							deviceid=UPBdata[7+i]; 
							refreshidflag=true;
						}
					}

					#ifdef ESP32US140Tversion
						// if the fade option is changed, update accordingly 
//						if ((regstart+i) == 0x8D) {globalfaderate=EEPROM.read(0x8D) & 0x0F;} // TBD
					#endif
						
					#ifdef ESP32US2240Tversion
						// if either fade option is changed, update accordingly 
//						if ((regstart+i) == 0x88) {globalfaderate1=EEPROM.read(0x88) & 0x0F;} // TBD
//						if ((regstart+i) == 0x89) {globalfaderate2=EEPROM.read(0x89) & 0x0F;} // TBD
					#endif
						
				}
				
				#if DEBUG_LEVEL > 1
					Serial.println();
				#endif
	
				seteepromchecksum();
				EEPROM.commit(); // immediately write in this case, so reads turn around properly
				commitflag=false;
				return;
			}    

			// dump EEPROM to serial monitor
			if ((msg == 0x12) && (optbytes==0))
			{
				validcommand=true;
				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Dump EEPROM");
				#endif
				dumpeeprom();
				return;
			}

			// heartbeat report
			if (msg == 0x13)
			{
				validcommand=true;
				clearstorederror();

				heartbeat(src);
				return;
			}

			// diagnostic error mode
			if (msg == 0x14)
			{
				validcommand=true;
				seterror(250, 105);
				return;
			}

			// reset (to defaults, ie reset EEPROM), requires password
			if ((msg == 0x1F) && (optbytes==2) && (UPBdata[6]==EEPROM.read(2)) && (UPBdata[7]==EEPROM.read(3)))
			{
				validcommand=true;
				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Reset EEPROM");
				#endif
				reseteeprom(EEPROM.read(0x09)+0x100*EEPROM.read(0x08)+0x10000*EEPROM.read(0x07)+0x1000000*EEPROM.read(0x06));
				refreshid();
				return;
			}

			// get status report
			if (msg == 0x30) 
			{
				validcommand=true;
				clearstorederror();
				#if DEBUG_LEVEL > 1
					Serial.println("Sending status report");
				#endif

