dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
				reportstatus(src);

				return;
			}

			if (linkflag==0) {device_generic_command(UPBdata);}
		}
	}
	
	if ((addressed) && (!validcommand))
	{
		seterror(250, 102);
		// hack to allow further movement on shade even after unknown commands
		error=0;
		
		// save packet into 0x100+
		for (uint8_t i=0; i<packetlength; i++)
		{
			EEPROM.write(0x100+i,UPBdata[i]);
		}
		EEPROM.commit();

		Serial.printf("Packet length %d\n",packetlength);

		Serial.println("Invalid command");
		Serial.print("CT1 CT2 NID DST SRC MSG ");
		for (uint8_t i=6; i<packetlength-1; i++)
		{
			Serial.printf("MD%02d ",i-6);
		}

		Serial.println("CS");

		for (uint8_t i=0; i<packetlength; i++)
		{
			Serial.printf("%02X  ",UPBdata[i]);
			if (i>13) {Serial.print("  ");}
		}
		Serial.println("\n");
		return;
	}
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void heartbeat(uint8_t who)
{
	#if DEBUG_LEVEL > 0
		Serial.println("Heartbeat");
	#endif
	bindata[0]=0x07;
	bindata[1]=EEPROM.read(0x8E) & 0b00001100;  // CTL2 includes transmission count
	bindata[2]=networkid; // NID
	bindata[3]=who;       // Dest (requesting source)
	bindata[4]=deviceid;  // Src (me)
	bindata[5]=0x93;      // Heartbeat report
	sendbinstring(bindata);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

String UPBdevicename(void)
{
	char roomname[17];
	roomname[16]=0x00;
	char devicename[17];
	devicename[16]=0x00;

	for (uint8_t i=0; i<16; i++) {roomname[i]=EEPROM.read(32+i);}
	for (uint8_t i=0; i<16; i++) {devicename[i]=EEPROM.read(48+i);}
	
//	Serial.print("Room   "); Serial.println(roomname);
//	Serial.print("Device "); Serial.println(devicename);
	
	return String(roomname)+" "+String(devicename);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

// save options
// REG8E=xxxx01xx writes bits 3&2 masked to register 0x8E
// REG12=34 writes 0x34 to register 0x12
// RGD56=78 writes *decimal* 78 to register 0x56 (for links)

void handleSaveSettings(AsyncWebServerRequest *request)
{
  uint8_t registerhex;
  uint8_t valuehex;
  uint8_t binaryvalue;
  uint8_t binarymask;
  uint8_t existingvalue;
  
	String returl="/edit";
  String reply="";

  uint8_t paramcount=request->params();

  for (uint8_t i=0; i<paramcount; i++)
  {
    if ((request->argName(i).indexOf("URL")) != -1)
    {
      returl=request->arg(i);
			Serial.print("Return to URL ");
			Serial.println(returl);
		}
	}

  reply="<meta http-equiv=\"refresh\" content=\"0; URL="+returl+"\">Refresh to <a href=\""+returl+"\">"+returl+"</a>";

  for (uint8_t i=0; i<paramcount; i++)
  {
    if ((request->argName(i).indexOf("RGD")) != -1)
    {
      String regstring=request->argName(i).substring(3,5);
      registerhex=hexStringToInt(regstring);

      String value=request->arg(i);
			int valuedec=value.toInt();
			reply=reply+"Write "+String(valuedec)+" to register "+registerhex+"<p>\n";
			EEPROM.write(registerhex,valuedec);
			commitflag=true;
		}

	
    if ((request->argName(i).indexOf("REG")) != -1)
    {
      String regstring=request->argName(i).substring(3,5);
      registerhex=hexStringToInt(regstring);

      String value=request->arg(i);
      if (value.length() == 8)
      {
        String bitmask;
        bitmask=value;
        // this takes a value of eg "xxxx01xx"
        // and changes it into a mask of "11110011"
        // which is AND'd with the existing value
        // then OR'd with the given value to create the final value
        bitmask.replace("1","0");
        bitmask.replace("x","1");
        bitmask.replace("X","1");
        value.replace("x","0");
        value.replace("X","0");
      
        existingvalue=EEPROM.read(registerhex);
        binarymask=binStringToInt(bitmask);
        binaryvalue=binStringToInt(value);
        EEPROM.write(registerhex,existingvalue & binarymask | binaryvalue);
        commitflag=true;
      }
      else
      {
        valuehex=hexStringToInt(value);
        EEPROM.write(registerhex,valuehex);
        commitflag=true;
      }
    }
  }

  request->send(200, "text/html", reply);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

// basically special case of handleUPBcommand

void handleEnterSetupMode(AsyncWebServerRequest *request)
{
	Serial.println("Enter setup mode via web UI");
	setupmode=true;
	blueLEDspacing=SETUP_BLINK_SPACING;
	setupmodestarted=millis();
	networkid=0x00; // broadcast network ID
	deviceid=0xFE; // broadcast device ID 
  String reply;

	String returnurl="/edit";

	if (request->hasParam("return"))
	{
		returnurl=request->getParam("return")->value();
	}

  reply="<meta http-equiv=\"refresh\" content=\"0; URL="+returnurl+"\">Refresh to <a href=\""+returnurl+"\">"+returnurl+"</a>";
  request->send(200, "text/html", reply);
	
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

// basically special case of handleUPBcommand

void handleExitSetupMode(AsyncWebServerRequest *request)
{
	Serial.println("Exit setup mode via web UI");
	blueLEDspacing=0;
	setupmode=false;
	writeenable=false;
	bluLEDval=0;
	setLEDs();
	networkid=EEPROM.read(0); // actual network ID  
	deviceid=EEPROM.read(1); // actual device ID
  String reply;

	String returnurl="/edit";

	if (request->hasParam("return"))
	{
		returnurl=request->getParam("return")->value();
	}

  reply="<meta http-equiv=\"refresh\" content=\"0; URL="+returnurl+"\">Refresh to <a href=\""+returnurl+"\">"+returnurl+"</a>";
  request->send(200, "text/html", reply);
	
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

// parses /upbcommand?cmd=XX[&opt=YY]
// cmd in hex, but opt in dec
// because it just works better, that's why (cmd=22 opt=100 for %age)

void handleUPBcommand(AsyncWebServerRequest *request)
{
  String reply;

