dremugit/ESP32UPB/esp32upb/ESP32UPBcore.h
	String returnurl="/edit";

	if (request->hasParam("return"))
	{
		returnurl=request->getParam("return")->value();
	}

  reply="<meta http-equiv=\"refresh\" content=\"0; URL="+returnurl+"\">Refresh to <a href=\""+returnurl+"\">"+returnurl+"</a>";

  uint8_t passedcmd;
  String passedopt;

  uint8_t proccmdlen=0;

  uint8_t chkforcmd=request->hasParam("cmd");
  if (chkforcmd==0)
  {
    reply="No command. Fail.";
  }
  else
  {
    proccmdlen=7;

    passedcmd=hexStringToInt(request->getParam("cmd")->value());

    if (request->hasParam("opt"))
    {
      passedopt=request->getParam("opt")->value();
      proccmdlen++;
    }
  }

  request->send(200, "text/html", reply);

  // only send if command was specified
  if (proccmdlen)
  {
    String proccmdstring;
    proccmdstring=makeNiceHexString(proccmdlen);
    proccmdstring=proccmdstring+makeNiceHexString(EEPROM.read(0x8E) & 0b00001100);
    proccmdstring=proccmdstring+makeNiceHexString(networkid);
    proccmdstring=proccmdstring+makeNiceHexString(thisIP); // dest
    proccmdstring=proccmdstring+makeNiceHexString(thisIP); // src
    proccmdstring=proccmdstring+makeNiceHexString(passedcmd);
    if (!passedopt.equals(""))
    {
      proccmdstring=proccmdstring+makeNiceHexString(passedopt.toInt());
    }

    char proccmdarray[proccmdstring.length()+2]={0};
    proccmdstring.toCharArray(proccmdarray,proccmdstring.length()+1);
		
		char csum[3]={0};
		
		sprintf(csum,"%02X",UPBchecksum(proccmdarray));
		
		proccmdarray[proccmdstring.length()]=csum[0]; // never actually used
		proccmdarray[proccmdstring.length()+1]=csum[1]; // never actually used
		proccmdarray[proccmdstring.length()+2]=0x00;
		
    processUPB(proccmdarray);
  }      
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

String noHTMLlink(void)
{
	return "<style type=\"text/css\">\n"
	"<!-- A:link {text-decoration:none} A:visited {text-decoration:none} A:active {text-decoration:none}-->\n"
	"</style>\n";
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

// /sendthiscommand?cmd=C1C2NIDSSRMD..CS
// cmd in hex, but opt in dec
// because it just works better, that's why (cmd=22 opt=100 for %age)

void handleSendThisCommand(AsyncWebServerRequest *request)
{
  String reply;

  uint8_t chkforcmd=request->hasParam("cmd");
  if (chkforcmd==0)
  {
    reply="No command. Fail.";
  }
  else
  {
		String sendthiscmdstring=request->getParam("cmd")->value();
    char sendthiscmdarray[2*(sendthiscmdstring.length()+1)];
    sendthiscmdstring.toCharArray(sendthiscmdarray,2*(sendthiscmdstring.length()+1));
    processUPB(sendthiscmdarray);
		reply=sendthiscmdstring+" sent.<p>";
  }      		
	
  request->send(200, "text/html", reply);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void handleDumpRegisters(AsyncWebServerRequest *request)
{
	String reply;
	reply="";
	
	char regbyte[3];
	
	for (uint16_t i=0; i<512; i++)
	{
		sprintf(regbyte,"%02X",EEPROM.read(i));
		reply=reply+String(regbyte);
	}
	
	request->send(200, "text/plain", reply);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

bool reconnect()
{
	// use MAC addr as MQTT ID
	// this means that even if a duplicate IP comes online, the MQTT doesn't go completely stupid
	// and still just reboots when things go awry
  	
	String mqttid=WiFi.macAddress();
	mqttid.replace(":","");
	char devname[13];
	mqttid.toCharArray(devname,13);
	Serial.print("MQTT identifier: ");
	Serial.println(devname);
	
	if (mqttclient.connect(devname))
  {
    // Once connected, (re)subscribe
    mqttclient.subscribe(wupbtopic);
  }
  return mqttclient.connected();
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void mqttcallback(char* topic, byte* payload, uint16_t msglength)
{
	char msgarray[msglength+1];
  memcpy(msgarray,payload,msglength);

	#if DEBUG_LEVEL > 1
		Serial.printf("[%s] ",wupbtopic);
		printableprint(msgarray,msglength,true);
	#endif
	
	processUPB(msgarray);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

void waitformqttconnect(uint32_t cycletime)
{
	uint32_t starttime=millis();
	
	#if DEBUG_LEVEL > 1
		Serial.println("Awaiting MQTT connect");
	#endif
	while ((millis() - starttime) < cycletime)
	{
		if (!mqttclient.connected())
		{
			uint32_t now = millis();
			if (now - lastReconnectAttempt > 5000)
			{
				lastReconnectAttempt = now;
				// Attempt to reconnect
				if (reconnect())
				{
					lastReconnectAttempt = 0;
				}
			}
		}
		else
		{
			// Client connected
			mqttclient.loop();
		}
	}
	#if DEBUG_LEVEL > 1
		Serial.println("MQTT connected");
	#endif
}